Revit 2027 API
StructuralElementDefinitionData.IsMirrored Property
 States if the structural section of the element is mirrored.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMirrored { get; }
Public ReadOnly Property IsMirrored As Boolean
	Get
public:
property bool IsMirrored {
	bool get ();
}
member IsMirrored : bool with get
Property Value
Boolean
See Also
Reference
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace